{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "TinyLlama/TinyLlama-1.1B-Chat-v1.0",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "lora_alpha": 16,
  "lora_bias": false,
  "lora_dropout": 0.1,
  "megatron_core": "megatron.core",
  "peft_type": "LORA",
  "r": 4,
  "target_modules": [
    "v_proj",
    "q_proj"
  ],
  "task_type": "CAUSAL_LM",
  "use_dora": false,
  "use_rslora": false
}